//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ТекущаяДата(Парам01)","ТекущаяДата","И текущая дата 17.09.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕстьСотрудникСДатойРождения(Парам01)","ЕстьСотрудникСДатойРождения","Допустим есть сотрудник с датой рождения 30.05.1988");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДатаРасчета(Парам01)","ДатаРасчета","И дата расчета 17.09.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВозрастВМесяцахБудетРавен(Парам01)","ВозрастВМесяцахБудетРавен","Тогда возраст в месяцах будет равен 339");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим есть сотрудник с датой рождения 30.05.1988
//@ЕстьСотрудникСДатойРождения(ДатаРождения)
Процедура ЕстьСотрудникСДатойРождения(ДатаРождения) Экспорт
	
	//Ванесса.ПосмотретьЗначение(ДатаРождения,Истина);
	Контекст.Вставить("ДатаРождения", ДатаРождения);
	
КонецПроцедуры

&НаКлиенте
//И дата расчета 17.09.2016
//@ДатаРасчета(ТекущаяДата)
Процедура ДатаРасчета(ТекущаяДата) Экспорт
	
	//Ванесса.ПосмотретьЗначение(ТекущаяДата,Истина);
	Контекст.Вставить("ТекущаяДата", ТекущаяДата);
	
КонецПроцедуры

&НаКлиенте
//Тогда возраст в месяцах будет равен 339
//@ВозрастВМесяцахБудетРавен(Результат)
Процедура ВозрастВМесяцахБудетРавен(Результат) Экспорт
	//Ванесса.ПосмотретьЗначение(Результат,Истина);
	Проверка = ОбщегоНазначенияКлиент.ВозрастВМесяцах(Контекст.ДатаРождения, Контекст.ТекущаяДата);
	Если Проверка <> Результат Тогда
		ВызватьИсключение "Тест не пройден!";
	КонецЕсли;
КонецПроцедуры

//окончание текста модуля

